FKDD_COPY_DIFF_3_2026-02-13/BusinessProcesses/БТ_СогласованиеЗаявокДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<BusinessProcess>
		<Properties>
			<Name>БТ_СогласованиеЗаявокДДС</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Task>Task.БТ_ЗадачиОбработкиЗаявокПользователя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отклонил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтменыЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопОпция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРасходДС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/БТ_ОтветственныеПоЗаявкамПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БТ_ОтветственныеПоЗаявкамПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЗаявкаПользователя</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.БТ_СогласованиеЗаявокДДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_РолиАдресатовЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Согласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Поле в котором хранится телефонный номер</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/БТ_РолиАдресатовЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>БТ_РолиАдресатовЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СотрудникЦФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительЦФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтерия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенеральныйДиректорДЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФинансовыйДиректор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенеральныйДиректорУК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казначей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенеральныйДиректорИД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/BusinessProcesses/БТ_СогласованиеЗаявокДДС/Ext/ManagerModule.bsl
Функция ПолучитьСоответсвиеРолейИТочекМаршрута() Экспорт
	
	СоответствиеРолей = новый Соответствие;
	СоответствиеРолей.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.Бухгалтерия, 			БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеБухгалтерия);
	//СоответствиеРолей.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорДЦ,	БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеГенеральныйДиректорДЦ);
	//СоответствиеРолей.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорУК, 	БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеГенеральныйДиректорУК);
	СоответствиеРолей.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.Казначей, 				БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеКазначей);
	//СоответствиеРолей.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.РуководительЦФО, 		БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеРуководительЦФО);
	СоответствиеРолей.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.СотрудникЦФО, 			БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеСотрудникЦФО);
	//СоответствиеРолей.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.ФинансовыйДиректор, 		БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеФинансовыйДиректор);
	
	Возврат СоответствиеРолей;
			
КонецФункции

Функция ПолучитьСтатусПоРоли(Роль) Экспорт
	
	СтатусПоРоли = Новый Соответствие;
	
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.Бухгалтерия, 				Перечисления.БТ_СтатусыЗаявок.УтвержденаКонтролером);
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорДЦ, 	Перечисления.БТ_СтатусыЗаявок.УтвержденаДЦ);
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорУК, 	Перечисления.БТ_СтатусыЗаявок.УтвержденаГДУК);
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.Казначей, 				Перечисления.БТ_СтатусыЗаявок.УтвержденаКазначеня);
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.РуководительЦФО, 			Перечисления.БТ_СтатусыЗаявок.УтвержденаЦФО);
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.СотрудникЦФО, 			Перечисления.БТ_СтатусыЗаявок.УтвержденаСотрудникЦФО);
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.ФинансовыйДиректор, 		Перечисления.БТ_СтатусыЗаявок.УтвержденаФД);
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорИД, 	Перечисления.БТ_СтатусыЗаявок.УтвержденаГДУИД); //ЧалапАЮ БизТех 13.11.2023

	Возврат СтатусПоРоли[Роль];
	
КонецФункции

Процедура ОбновитьСведенияПоТекущейЗаявке(Заявка, ТабДокОписаниеЗаявки, ТабДокИсторияСогласования, КартаМаршрутаЗаявки,  АдресРасшифровки, АдресДанныхРасшифровкиОписаниеЗаявки) Экспорт
	Если Заявка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТабДокОписаниеЗаявки<>Неопределено Тогда
		ОбновитьСведенияПоТекущейЗаявке_ТабДокОписаниеЗаявки(Заявка, ТабДокОписаниеЗаявки, АдресРасшифровки, АдресДанныхРасшифровкиОписаниеЗаявки);
	КонецЕсли;
	
	Если ТабДокИсторияСогласования<>Неопределено Тогда
		ОбновитьСведенияПоТекущейЗаявке_ТабДокИсторияСогласования(Заявка, ТабДокИсторияСогласования);
	КонецЕсли;
	//
	Если КартаМаршрутаЗаявки<>Неопределено Тогда
		ОбновитьСведенияПоТекущейЗаявке_КартаМаршрутаЗаявки(Заявка, КартаМаршрутаЗаявки);
	КонецЕсли;
КонецПроцедуры

Процедура  ДобавитьЗначениеВТЧ(ТЧ, Выборка, ИмяРеквизита)
	
	НовСтр = ТЧ.Добавить();
	НовСтр.НомерСтрокиТЧ 	= Выборка.НомерСтроки; 	
	НовСтр.ЗначениеТЧТекст 	= Строка(Выборка[ИмяРеквизита]);
	НовСтр.СвойствоТЧ 		= ИмяРеквизита;
	НовСтр.ЗначениеТЧ 		= Выборка[ИмяРеквизита];
	
КонецПроцедуры

Процедура ОбновитьСведенияПоТекущейЗаявке_ТабДокОписаниеЗаявки(Заявка, ТабДокОписаниеЗаявки, АдресРасшифровки, АдресДанныхРасшифровкиОписаниеЗаявки, ТЗ = Неопределено) Экспорт
	СКД = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ПолучитьМакет("ПросмотрЗаявки");
	СКД.Параметры.Заявка.Значение = Заявка;   
	
	Настройки	= СКД.ВариантыНастроек["ПросмотрЗаявки"].Настройки;
	ЗаявкаПараметр = Настройки.ПараметрыДанных.Элементы.Найти("Заявка");
	ЗаявкаПараметр.Значение			= Заявка;
	ЗаявкаПараметр.Использование	= Истина;
	
	ВнешниеНаборыДанных = Новый Структура;

	ТаблицаРеквизитовТЧПомещаемаяВСКД = Новый ТаблицаЗначений;
	КС = Новый КвалификаторыСтроки(0);
	Массив = Новый Массив;                           
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	ОписаниеТиповБ = Новый ОписаниеТипов("Булево");
	ТаблицаРеквизитовТЧПомещаемаяВСКД.Колонки.Добавить("ЗначениеТЧТекст"		, ОписаниеТиповС, "ЗначениеТЧТекст");
	ТаблицаРеквизитовТЧПомещаемаяВСКД.Колонки.Добавить("СвойствоТЧ"				, ОписаниеТиповС, "СвойствоРеквизита");
	ТаблицаРеквизитовТЧПомещаемаяВСКД.Колонки.Добавить("ЗначениеТЧ"				,				, "Значение реквизита");
	ТаблицаРеквизитовТЧПомещаемаяВСКД.Колонки.Добавить("НомерСтрокиТЧ"			, ОписаниеТиповС, "НомерСтрокиТЧ");
	ТаблицаРеквизитовТЧПомещаемаяВСКД.Колонки.Добавить("Выделить"				, ОписаниеТиповБ, "Выделить");
	ТаблицаРеквизитовТЧПомещаемаяВСКД.Колонки.Добавить("ВыделитьКраснымТЧ"		, ОписаниеТиповБ, "Выделить красным");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРасходДСПлатежи.Ссылка КАК Ссылка,
		|	ЗаявкаНаРасходДСПлатежи.НомерСтроки КАК НомерСтроки,
		|	ЗаявкаНаРасходДСПлатежи.ДатаПлатежа КАК ДатаПлатежа,
		|	ЗаявкаНаРасходДСПлатежи.СтатьяРасходов КАК СтатьяРасходов,
		|	ЗаявкаНаРасходДСПлатежи.Описание КАК Описание,
		|	ЗаявкаНаРасходДСПлатежи.Сумма КАК Сумма,
		|	ЗаявкаНаРасходДСПлатежи.СтавкаНДС КАК СтавкаНДС,
		|	ЗаявкаНаРасходДСПлатежи.СуммаНДС КАК СуммаНДС,
		|	БТ_СогласованиеЗаявокДДС.Ссылка КАК Ссылка1
		|ИЗ
		|	Документ.ЗаявкаНаРасходДС.Платежи КАК ЗаявкаНаРасходДСПлатежи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.БТ_СогласованиеЗаявокДДС КАК БТ_СогласованиеЗаявокДДС
		|		ПО ЗаявкаНаРасходДСПлатежи.Ссылка = БТ_СогласованиеЗаявокДДС.ЗаявкаНаРасходДС
		|ГДЕ
		|	БТ_СогласованиеЗаявокДДС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		ДобавитьЗначениеВТЧ(ТаблицаРеквизитовТЧПомещаемаяВСКД, Выборка, "ДатаПлатежа");
		ДобавитьЗначениеВТЧ(ТаблицаРеквизитовТЧПомещаемаяВСКД, Выборка, "СтатьяРасходов");
		ДобавитьЗначениеВТЧ(ТаблицаРеквизитовТЧПомещаемаяВСКД, Выборка, "Описание");
		ДобавитьЗначениеВТЧ(ТаблицаРеквизитовТЧПомещаемаяВСКД, Выборка, "Сумма");
		ДобавитьЗначениеВТЧ(ТаблицаРеквизитовТЧПомещаемаяВСКД, Выборка, "СтавкаНДС");
		ДобавитьЗначениеВТЧ(ТаблицаРеквизитовТЧПомещаемаяВСКД, Выборка, "СуммаНДС"); 
		
	КонецЦикла;
	
	ВнешниеНаборыДанных.Вставить("РеквизитыТЧ", ТаблицаРеквизитовТЧПомещаемаяВСКД);
	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	ТабДокОписаниеЗаявкиДанныеРасшифровки	= Новый ДанныеРасшифровкиКомпоновкиДанных;
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(СКД, Настройки, ТабДокОписаниеЗаявкиДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ТабДокОписаниеЗаявкиДанныеРасшифровки, Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТабДокОписаниеЗаявки.Очистить();
	ПроцессорВывода.УстановитьДокумент(ТабДокОписаниеЗаявки);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	ТабДокОписаниеЗаявки.ОтображатьСетку		= Ложь;
	ТабДокОписаниеЗаявки.ОтображатьЗаголовки	= Ложь;
	ТабДокОписаниеЗаявки.ПолеСлева = 20;                          
	
	Если ТЗ = Неопределено Тогда
		
		АдресДанныхРасшифровкиОписаниеЗаявки = ПоместитьВоВременноеХранилище(ТабДокОписаниеЗаявкиДанныеРасшифровки, АдресРасшифровки);
		
	Иначе
	
		КомпоновщикНастроекТЗ = Новый КомпоновщикНастроекКомпоновкиДанных;
	    КомпоновщикНастроекТЗ.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	    КомпоновщикНастроекТЗ.ЗагрузитьНастройки(Настройки);
	    НастройкиКомпоновщика = КомпоновщикНастроекТЗ.Настройки;
		
		МакетКомпоновки = Новый КомпоновщикМакетаКомпоновкиДанных; 
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СКД, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	    Процессор = Новый ПроцессорКомпоновкиДанных;
	    Процессор.Инициализировать(МакетКомпоновкиДанных);
	    ТЗ = Новый ТаблицаЗначений;
	    ТЗ.Очистить();
	    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	    ПроцессорВывода.УстановитьОбъект(ТЗ);
	    ПроцессорВывода.Вывести(Процессор);	                                                                                         
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСведенияПоТекущейЗаявке_ТабДокИсторияСогласования(Заявка, ТабДокИсторияСогласования)
	СКД			= ПолучитьОбщийМакет("БТ_СогласователиЗаявок");
	СКД.Параметры.ЗаявкаПользователя.Значение = Заявка;
	//СКД.Параметры.НеВыводитьТекущихСогласующих.Значение = Ложь;
	Настройки	= СКД.ВариантыНастроек["Основной"].Настройки;
	ЗаявкаПараметр = Настройки.ПараметрыДанных.Элементы.Найти("ЗаявкаПользователя");
	ЗаявкаПараметр.Значение = Заявка;
	ЗаявкаПараметр.Использование = Истина;
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(СКД, Настройки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,,Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТабДокИсторияСогласования.Очистить();
	ПроцессорВывода.УстановитьДокумент(ТабДокИсторияСогласования);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	ТабДокИсторияСогласования.ОтображатьСетку		= Ложь;
	ТабДокИсторияСогласования.ОтображатьЗаголовки	= Ложь;	
КонецПроцедуры

Процедура ОбновитьСведенияПоТекущейЗаявке_КартаМаршрутаЗаявки(Заявка, КартаМаршрутаЗаявки)
	КартаМаршрутаЗаявки = БТ_БизнесПроцессы.СформироватьКартуМаршрута(Заявка);
	КартаМаршрутаЗаявки.РежимОтрисовкиСетки = РежимОтрисовкиСеткиГрафическойСхемы.НеРисовать;
КонецПроцедуры

Функция УзнатьПолучателей(Ссылка, Роль)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтветственныеПоЗаявкамПользователей.Согласующий КАК Согласующий,
	|	ОтветственныеПоЗаявкамПользователей.Согласующий.Наименование КАК СогласующийНаименование,
	|	КонтактнаяИнформация.Представление КАК ЭлектронныйАдресс
	|ИЗ
	|	РегистрСведений.БТ_ОтветственныеПоЗаявкамПользователей КАК ОтветственныеПоЗаявкамПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ОтветственныеПоЗаявкамПользователей.Согласующий.Сотрудник = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий))";    
	
	Запрос.УстановитьПараметр("ЗаявкаПользователя"	, Ссылка);
	Запрос.УстановитьПараметр("Роль"				, Роль); 
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции 

Процедура СформироватьПисьмо(БПСогласование, Тема, Роль = Неопределено, Комментарий = Неопределено) Экспорт     
	
	Если Роль = Неопределено Тогда
		
		СписокПолучателей = БТ_СлужебныеФункции.УзнатьЭлектроннуюПочту(БТ_СлужебныеФункции.ПолучитьЗначениеРеквизита(БПСогласование, "Пользователь.Сотрудник"));
		
	Иначе
		
		СписокПолучателей 	= УзнатьПолучателей(БПСогласование, Роль); 
		
	КонецЕсли;                         
	
	СписокПолучателейРассылки = Новый СписокЗначений;       
	
	Если СписокПолучателей.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Пока СписокПолучателей.Следующий() Цикл                                  
		
		СписокПолучателейРассылки.Добавить(СписокПолучателей.ЭлектронныйАдресс);
		
	КонецЦикла;			
	
	Попытка
		
		ТекстПисьма				= БизнесПроцессы.БТ_СогласованиеЗаявокДДС.СформироватьСообщение(БПСогласование);
		
	Исключение                                                                      
		
		ТекстПисьма				= "";
		
	КонецПопытки; 
	
	ТекстПисьма = ТекстПисьма + ?(не Комментарий = Неопределено, "<br><br>" + Комментарий, "");
	
	БТ_СлужебныеФункции.ОтправитьЭлПисьмо(Тема, ТекстПисьма, СписокПолучателейРассылки);
	
КонецПроцедуры

Функция СформироватьСообщение(Ссылка) Экспорт 
	
	ТабДокумент = Новый ТабличныйДокумент;     
	
	БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ОбновитьСведенияПоТекущейЗаявке_ТабДокОписаниеЗаявки(Ссылка, ТабДокумент, Неопределено, Неопределено);
	HTML = ПолучитьИмяВременногоФайла("HTML"); 
	
	ТабДокумент.Записать(HTML, ТипФайлаТабличногоДокумента.HTML);
	
	СтрокаВозврата = "";
	
	Текст = Новый ЧтениеТекста(HTML);

	Строка = Текст.ПрочитатьСтроку();

	Пока Строка <> Неопределено Цикл 

		СтрокаВозврата = "" + СтрокаВозврата + Строка;

		Строка = Текст.ПрочитатьСтроку();

	КонецЦикла;	           
	
	Возврат СтрокаВозврата
КонецФункции
